Revit 2024 API
ScheduleDefinition.GetFieldIndex Method
 Converts a field ID to the corresponding field index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int GetFieldIndex(
	ScheduleFieldId fieldId
)
Visual Basic
Public Function GetFieldIndex ( _
	fieldId As ScheduleFieldId _
) As Integer
Visual C++
public:
int GetFieldIndex(
	ScheduleFieldId^ fieldId
)
Parameters
fieldId
Type: Autodesk.Revit.DB.ScheduleFieldId
 The field ID.
Return Value
 The field index.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace